<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Assets.car</key>
		<data>
		ZxSNugljT3RNWqDsNmDlLONaP0I=
		</data>
		<key>CardScan.storyboardc/Info.plist</key>
		<data>
		ITnP0DGQ6iQHTbdaNt78cxkoQMo=
		</data>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/objects-11.0+.nib</key>
		<data>
		6gMeg6DnJANOFRsFrNMhdowlKR8=
		</data>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/runtime.nib</key>
		<data>
		lGo5E1tLcOjL1gkLowcYq5DVy30=
		</data>
		<key>CardScan.storyboardc/scanCardViewController.nib/objects-11.0+.nib</key>
		<data>
		CxLgKIKNHrYv/G6SzF2HPSAYZX8=
		</data>
		<key>CardScan.storyboardc/scanCardViewController.nib/runtime.nib</key>
		<data>
		71wEkfcLhQUe57nF/93sEuyn3KQ=
		</data>
		<key>Config/card_types.txt</key>
		<data>
		RTgAYbU/tSutxSHDJ9ypn0hBrAg=
		</data>
		<key>SSDOcr.mlmodelc/coremldata.bin</key>
		<data>
		F6zlnUcthx6QIQ7BFq5MmmvLPuQ=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.net</key>
		<data>
		YvnwMG8958dLbTAe6NS32RI9zcE=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.shape</key>
		<data>
		iMrTHag2ugfNEacP5gC1Q+ecXk8=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.weights</key>
		<data>
		PObM/mvTxhseG0ZBN7HvnJW2afc=
		</data>
		<key>SSDOcr.mlmodelc/model/coremldata.bin</key>
		<data>
		wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
		</data>
		<key>SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Assets.car</key>
		<dict>
			<key>hash</key>
			<data>
			ZxSNugljT3RNWqDsNmDlLONaP0I=
			</data>
			<key>hash2</key>
			<data>
			2S+p+OeeXdBnTsM5VMQc/t1v62RQZvYQGhVXUaH0azk=
			</data>
		</dict>
		<key>CardScan.storyboardc/Info.plist</key>
		<dict>
			<key>hash</key>
			<data>
			ITnP0DGQ6iQHTbdaNt78cxkoQMo=
			</data>
			<key>hash2</key>
			<data>
			Mi4XiqiCD95tFZJtKjB+STfGFfGE8PzaGNtjbYbE0qo=
			</data>
		</dict>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/objects-11.0+.nib</key>
		<dict>
			<key>hash</key>
			<data>
			6gMeg6DnJANOFRsFrNMhdowlKR8=
			</data>
			<key>hash2</key>
			<data>
			TiEI68WDAxhODneBb/3gKIWVt8P/kksyg5at51WLkbo=
			</data>
		</dict>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/runtime.nib</key>
		<dict>
			<key>hash</key>
			<data>
			lGo5E1tLcOjL1gkLowcYq5DVy30=
			</data>
			<key>hash2</key>
			<data>
			9mmjid7xC4wsDUQcaJcPXaumcTX1N21+1ixHYo/gkEA=
			</data>
		</dict>
		<key>CardScan.storyboardc/scanCardViewController.nib/objects-11.0+.nib</key>
		<dict>
			<key>hash</key>
			<data>
			CxLgKIKNHrYv/G6SzF2HPSAYZX8=
			</data>
			<key>hash2</key>
			<data>
			I/5HAIndyHNCdyQkdDkhxHPOKHYM3+Q9cvkESvCWZtw=
			</data>
		</dict>
		<key>CardScan.storyboardc/scanCardViewController.nib/runtime.nib</key>
		<dict>
			<key>hash</key>
			<data>
			71wEkfcLhQUe57nF/93sEuyn3KQ=
			</data>
			<key>hash2</key>
			<data>
			l4SDgRuNMzS7ARZKR+KSc1Br3QNddWyrzveucfT3ITs=
			</data>
		</dict>
		<key>Config/card_types.txt</key>
		<dict>
			<key>hash</key>
			<data>
			RTgAYbU/tSutxSHDJ9ypn0hBrAg=
			</data>
			<key>hash2</key>
			<data>
			XGoevBnAadOR/4UwuXXtMuZyWcS9TvBYH2TdtPeAU3g=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			F6zlnUcthx6QIQ7BFq5MmmvLPuQ=
			</data>
			<key>hash2</key>
			<data>
			n8u+JttrnCj5hcadO9ONUmCEMZbdfiWGSMLJ2HTbZ50=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			YvnwMG8958dLbTAe6NS32RI9zcE=
			</data>
			<key>hash2</key>
			<data>
			thLw37ZKPIwFLkoJxV1/mM3i9OY8n2MCKlBLnHdZ0/4=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			iMrTHag2ugfNEacP5gC1Q+ecXk8=
			</data>
			<key>hash2</key>
			<data>
			cAvUUyQq2HU51ezroyh7pgCCJFfBMxIlk+d7SVtKwh0=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			PObM/mvTxhseG0ZBN7HvnJW2afc=
			</data>
			<key>hash2</key>
			<data>
			oT/Gghig43PrZvEbK4QLjX/4EbDWh/pmTNSBHakJ8vA=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
			</data>
			<key>hash2</key>
			<data>
			hbCZFIrZAF+IjdmBIFJ3wbNm1hBnaN4fctkyWK6u12w=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
