<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>CardScan.bundle/Assets.car</key>
		<data>
		ZxSNugljT3RNWqDsNmDlLONaP0I=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/Info.plist</key>
		<data>
		ITnP0DGQ6iQHTbdaNt78cxkoQMo=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/objects-11.0+.nib</key>
		<data>
		6gMeg6DnJANOFRsFrNMhdowlKR8=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/runtime.nib</key>
		<data>
		lGo5E1tLcOjL1gkLowcYq5DVy30=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/objects-11.0+.nib</key>
		<data>
		CxLgKIKNHrYv/G6SzF2HPSAYZX8=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/runtime.nib</key>
		<data>
		71wEkfcLhQUe57nF/93sEuyn3KQ=
		</data>
		<key>CardScan.bundle/Config/card_types.txt</key>
		<data>
		RTgAYbU/tSutxSHDJ9ypn0hBrAg=
		</data>
		<key>CardScan.bundle/Info.plist</key>
		<data>
		regyuRil/2Vg67MvTHz0x5KKGSA=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/coremldata.bin</key>
		<data>
		F6zlnUcthx6QIQ7BFq5MmmvLPuQ=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.net</key>
		<data>
		YvnwMG8958dLbTAe6NS32RI9zcE=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.shape</key>
		<data>
		iMrTHag2ugfNEacP5gC1Q+ecXk8=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.weights</key>
		<data>
		PObM/mvTxhseG0ZBN7HvnJW2afc=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model/coremldata.bin</key>
		<data>
		wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeDirectory</key>
		<data>
		EgsiF/GkCszh9Nh0LQR6+sv+w5Y=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements</key>
		<data>
		OnX22wWFKRSOFN1+obRynMCeyXM=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements-1</key>
		<data>
		Cjpkh0b9CBr3P6C6MYRYp0qtWEg=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeResources</key>
		<data>
		C2k2maHEh/SPXeod25jzB+eHFQQ=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeSignature</key>
		<data>
		2jmj7l5rSw0yVb/vlWAYkK/YBwk=
		</data>
		<key>Headers/CardScan-Swift.h</key>
		<data>
		iOaH2sgJfo6uet+/sh5K8fowCXU=
		</data>
		<key>Headers/CardScan-umbrella.h</key>
		<data>
		EllHr45lwngPVzZcLyH1O3DsfCg=
		</data>
		<key>Info.plist</key>
		<data>
		C7JTmb1ImQziJ7uXPOBc0PdlifE=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<data>
		g9ViVPcYN5VKznyUe7hkpsdqdd4=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<data>
		sGl+sU7juNm+bCECzVJoibSQ6VM=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<data>
		mAnoiJFDhvSaHLu/y+/jxuZAy4o=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftdoc</key>
		<data>
		g9ViVPcYN5VKznyUe7hkpsdqdd4=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftinterface</key>
		<data>
		sGl+sU7juNm+bCECzVJoibSQ6VM=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftmodule</key>
		<data>
		mAnoiJFDhvSaHLu/y+/jxuZAy4o=
		</data>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftdoc</key>
		<data>
		HyHT1xnBMUAIQVL3t0iDuAFQywE=
		</data>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftinterface</key>
		<data>
		n87XLKtbyfTRbliuPTMjjPuBKSM=
		</data>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftmodule</key>
		<data>
		FOlbFGQg+kL4D5kVUb+QaTGjhUE=
		</data>
		<key>Modules/CardScan.swiftmodule/i386.swiftdoc</key>
		<data>
		HyHT1xnBMUAIQVL3t0iDuAFQywE=
		</data>
		<key>Modules/CardScan.swiftmodule/i386.swiftinterface</key>
		<data>
		n87XLKtbyfTRbliuPTMjjPuBKSM=
		</data>
		<key>Modules/CardScan.swiftmodule/i386.swiftmodule</key>
		<data>
		FOlbFGQg+kL4D5kVUb+QaTGjhUE=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		gnlihs4irU2GuTmCN+D6BF5vVc0=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		t8zliOUw9DkzJgLiv26mj8Woh8A=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		4CDBYxeEElwJNeo11IgTWsmWMuk=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<data>
		gnlihs4irU2GuTmCN+D6BF5vVc0=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<data>
		t8zliOUw9DkzJgLiv26mj8Woh8A=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<data>
		4CDBYxeEElwJNeo11IgTWsmWMuk=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		H2UtVu61qUO9bRvj2QjRQkOqG5w=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>CardScan.bundle/Assets.car</key>
		<dict>
			<key>hash</key>
			<data>
			ZxSNugljT3RNWqDsNmDlLONaP0I=
			</data>
			<key>hash2</key>
			<data>
			2S+p+OeeXdBnTsM5VMQc/t1v62RQZvYQGhVXUaH0azk=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/Info.plist</key>
		<dict>
			<key>hash</key>
			<data>
			ITnP0DGQ6iQHTbdaNt78cxkoQMo=
			</data>
			<key>hash2</key>
			<data>
			Mi4XiqiCD95tFZJtKjB+STfGFfGE8PzaGNtjbYbE0qo=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/objects-11.0+.nib</key>
		<dict>
			<key>hash</key>
			<data>
			6gMeg6DnJANOFRsFrNMhdowlKR8=
			</data>
			<key>hash2</key>
			<data>
			TiEI68WDAxhODneBb/3gKIWVt8P/kksyg5at51WLkbo=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/runtime.nib</key>
		<dict>
			<key>hash</key>
			<data>
			lGo5E1tLcOjL1gkLowcYq5DVy30=
			</data>
			<key>hash2</key>
			<data>
			9mmjid7xC4wsDUQcaJcPXaumcTX1N21+1ixHYo/gkEA=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/objects-11.0+.nib</key>
		<dict>
			<key>hash</key>
			<data>
			CxLgKIKNHrYv/G6SzF2HPSAYZX8=
			</data>
			<key>hash2</key>
			<data>
			I/5HAIndyHNCdyQkdDkhxHPOKHYM3+Q9cvkESvCWZtw=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/runtime.nib</key>
		<dict>
			<key>hash</key>
			<data>
			71wEkfcLhQUe57nF/93sEuyn3KQ=
			</data>
			<key>hash2</key>
			<data>
			l4SDgRuNMzS7ARZKR+KSc1Br3QNddWyrzveucfT3ITs=
			</data>
		</dict>
		<key>CardScan.bundle/Config/card_types.txt</key>
		<dict>
			<key>hash</key>
			<data>
			RTgAYbU/tSutxSHDJ9ypn0hBrAg=
			</data>
			<key>hash2</key>
			<data>
			XGoevBnAadOR/4UwuXXtMuZyWcS9TvBYH2TdtPeAU3g=
			</data>
		</dict>
		<key>CardScan.bundle/Info.plist</key>
		<dict>
			<key>hash</key>
			<data>
			regyuRil/2Vg67MvTHz0x5KKGSA=
			</data>
			<key>hash2</key>
			<data>
			Cle3WPGX0k2DFYbTHGkIDKuiSLMe/cju0j/mi1B6V/4=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			F6zlnUcthx6QIQ7BFq5MmmvLPuQ=
			</data>
			<key>hash2</key>
			<data>
			n8u+JttrnCj5hcadO9ONUmCEMZbdfiWGSMLJ2HTbZ50=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			YvnwMG8958dLbTAe6NS32RI9zcE=
			</data>
			<key>hash2</key>
			<data>
			thLw37ZKPIwFLkoJxV1/mM3i9OY8n2MCKlBLnHdZ0/4=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			iMrTHag2ugfNEacP5gC1Q+ecXk8=
			</data>
			<key>hash2</key>
			<data>
			cAvUUyQq2HU51ezroyh7pgCCJFfBMxIlk+d7SVtKwh0=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			PObM/mvTxhseG0ZBN7HvnJW2afc=
			</data>
			<key>hash2</key>
			<data>
			oT/Gghig43PrZvEbK4QLjX/4EbDWh/pmTNSBHakJ8vA=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
			</data>
			<key>hash2</key>
			<data>
			hbCZFIrZAF+IjdmBIFJ3wbNm1hBnaN4fctkyWK6u12w=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeDirectory</key>
		<dict>
			<key>hash</key>
			<data>
			EgsiF/GkCszh9Nh0LQR6+sv+w5Y=
			</data>
			<key>hash2</key>
			<data>
			tk4UXzZLK/MrmuzzJWvWanfvTyKkLLb88fezruAiVoY=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements</key>
		<dict>
			<key>hash</key>
			<data>
			OnX22wWFKRSOFN1+obRynMCeyXM=
			</data>
			<key>hash2</key>
			<data>
			mHkgkE6rZQ51eIwFSqCwUk5qgL/HGqMt+NI3phdD+YY=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements-1</key>
		<dict>
			<key>hash</key>
			<data>
			Cjpkh0b9CBr3P6C6MYRYp0qtWEg=
			</data>
			<key>hash2</key>
			<data>
			J3dkMZfFe3jRAr6OTafIfrPYz94jb9GWgSqlUWnc7cw=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeResources</key>
		<dict>
			<key>hash</key>
			<data>
			C2k2maHEh/SPXeod25jzB+eHFQQ=
			</data>
			<key>hash2</key>
			<data>
			FkFlR/QVWDvEIN78XriwlpTwhx24udoA7tpXIvKTCes=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeSignature</key>
		<dict>
			<key>hash</key>
			<data>
			2jmj7l5rSw0yVb/vlWAYkK/YBwk=
			</data>
			<key>hash2</key>
			<data>
			47DEQpj8HBSa+/TImW+5JCeuQeRkm5NMpJWZG3hSuFU=
			</data>
		</dict>
		<key>Headers/CardScan-Swift.h</key>
		<dict>
			<key>hash</key>
			<data>
			iOaH2sgJfo6uet+/sh5K8fowCXU=
			</data>
			<key>hash2</key>
			<data>
			d479wPfBUw004YyJ+VLR4J+9xLnrOG1RxeMgb78uX3M=
			</data>
		</dict>
		<key>Headers/CardScan-umbrella.h</key>
		<dict>
			<key>hash</key>
			<data>
			EllHr45lwngPVzZcLyH1O3DsfCg=
			</data>
			<key>hash2</key>
			<data>
			vRmWnPyHccaYzbi9scI2xwrjiPpNg06o+Hfc2Cx1tv0=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			g9ViVPcYN5VKznyUe7hkpsdqdd4=
			</data>
			<key>hash2</key>
			<data>
			Kxh3btYnZIlhjWtm/GK285GBOiXIbX3X+/IcA1DEHfI=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			sGl+sU7juNm+bCECzVJoibSQ6VM=
			</data>
			<key>hash2</key>
			<data>
			p4Arj1p2gG4X5M3JBf1X7PRWJnK7/ixF2PUrsoadVFU=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			mAnoiJFDhvSaHLu/y+/jxuZAy4o=
			</data>
			<key>hash2</key>
			<data>
			4xQ2rr+dt0HkiVGi1bT21vJJp/GTFV41CTHlzioAfww=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			g9ViVPcYN5VKznyUe7hkpsdqdd4=
			</data>
			<key>hash2</key>
			<data>
			Kxh3btYnZIlhjWtm/GK285GBOiXIbX3X+/IcA1DEHfI=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			sGl+sU7juNm+bCECzVJoibSQ6VM=
			</data>
			<key>hash2</key>
			<data>
			p4Arj1p2gG4X5M3JBf1X7PRWJnK7/ixF2PUrsoadVFU=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			mAnoiJFDhvSaHLu/y+/jxuZAy4o=
			</data>
			<key>hash2</key>
			<data>
			4xQ2rr+dt0HkiVGi1bT21vJJp/GTFV41CTHlzioAfww=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			HyHT1xnBMUAIQVL3t0iDuAFQywE=
			</data>
			<key>hash2</key>
			<data>
			ikenlTbfcpseLcveb/6cs+3V/U6R9FtEsQsoQXp6oaA=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			n87XLKtbyfTRbliuPTMjjPuBKSM=
			</data>
			<key>hash2</key>
			<data>
			yH7mViZflYlupOunXAeu7diDz9c8DOQ3RLv/51vEU48=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			FOlbFGQg+kL4D5kVUb+QaTGjhUE=
			</data>
			<key>hash2</key>
			<data>
			aEEyeDKVk0z70JWxrAn0HL24Jv7zcXxgTYXDCyIko10=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			HyHT1xnBMUAIQVL3t0iDuAFQywE=
			</data>
			<key>hash2</key>
			<data>
			ikenlTbfcpseLcveb/6cs+3V/U6R9FtEsQsoQXp6oaA=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			n87XLKtbyfTRbliuPTMjjPuBKSM=
			</data>
			<key>hash2</key>
			<data>
			yH7mViZflYlupOunXAeu7diDz9c8DOQ3RLv/51vEU48=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			FOlbFGQg+kL4D5kVUb+QaTGjhUE=
			</data>
			<key>hash2</key>
			<data>
			aEEyeDKVk0z70JWxrAn0HL24Jv7zcXxgTYXDCyIko10=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			gnlihs4irU2GuTmCN+D6BF5vVc0=
			</data>
			<key>hash2</key>
			<data>
			BZrKSRYnDVgNFO8GXWcEr3saFNC9DZYiQ213OsioT/A=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			t8zliOUw9DkzJgLiv26mj8Woh8A=
			</data>
			<key>hash2</key>
			<data>
			XD9D1agRmidiG8nUvibJC6MHVfX7G7i8uUi1qxiufuc=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			4CDBYxeEElwJNeo11IgTWsmWMuk=
			</data>
			<key>hash2</key>
			<data>
			VsfUStXzI2prSJm/e745/WuQ4MWQaLvDaV7SRqrE1oc=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			gnlihs4irU2GuTmCN+D6BF5vVc0=
			</data>
			<key>hash2</key>
			<data>
			BZrKSRYnDVgNFO8GXWcEr3saFNC9DZYiQ213OsioT/A=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			t8zliOUw9DkzJgLiv26mj8Woh8A=
			</data>
			<key>hash2</key>
			<data>
			XD9D1agRmidiG8nUvibJC6MHVfX7G7i8uUi1qxiufuc=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			4CDBYxeEElwJNeo11IgTWsmWMuk=
			</data>
			<key>hash2</key>
			<data>
			VsfUStXzI2prSJm/e745/WuQ4MWQaLvDaV7SRqrE1oc=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash</key>
			<data>
			H2UtVu61qUO9bRvj2QjRQkOqG5w=
			</data>
			<key>hash2</key>
			<data>
			SMM5FzkaThOGm6C1LVs+iMmXzl7uaRbJwnDcPnq2hSg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
