Repository: getbouncer/cardscan-ios
Catalog: CardScan/CardScan/Resources/*.lproj/Localizable.strings
Languages: ar, de, es, fr, he, hi, id, ja, ko, pt_br, pt_pt, ru, zh_hans, zh_hant

source: Scan Card
ar: المسح الضوئي للبطاقة
de: Karte einscannen
es: Escanear tarjeta
fr: Scanner la carte
he: סרקו כרטיס
hi: कार्ड स्कैन करें
id: Pindai Kartu
ja: カードをスキャン
ko: 카드 스캔
pt_br: Escanear cartão
pt_pt: Scanear cartão
ru: Сканировать карту
zh_hans: 扫描银行卡
zh_hant: 掃描卡片

source: Enable camera access
ar: تمكين الوصول إلى الكاميرا
de: Kamerazugriff aktivieren
es: Permitir acceso a la cámara
fr: Activer la caméra
he: אפשרו גישה למצלמה
hi: कैमरा एक्सेस सक्षम करें
id: Aktifkan akses kamera
ja: カメラのアクセスを有効にする
ko: 카메라 액세스 활성화
pt_br: Permitir acesso à câmera
pt_pt: Permitir acesso à câmara
ru: Разрешить доступ к камере
zh_hans: 启用相机访问权限
zh_hant: 啟用相機存取權限

source: To scan your card you'll need to update your phone settings
ar: للمسح الضوئي لبطاقتك، ستحتاج إلى تحديث إعدادات هاتفك
de: Zum Einscannen Ihrer Karte müssen Sie die Einstellungen Ihres Telefons aktualisieren
es: Para escanear tu tarjeta tendrás que actualizar los ajustes de tu teléfono
fr: Pour scanner votre carte, vous devez mettre à jour les paramètres de votre téléphone
he: כדי לסרוק את הכרטיס שלכם תצטרכו לעדכן את הגדרות הטלפון שלכם
hi: अपने कार्ड को स्कैन करने के लिए आपको अपने फ़ोन की सेटिंग अपडेट करनी होगी
id: Untuk memindai kartu, Anda perlu memperbarui pengaturan telepon Anda
ja: カードをスキャ ンするにはスマホの設定を更新する必要があります
ko: 카드를 스캔하려면 스마트폰 설정을 업데이트해 주셔야 합니다
pt_br: Para escanear seu cartão, você precisará atualizar as configurações de seu telefone
pt_pt: Para scanear o seu cartão, necessita de atualizar as definições do seu telefone
ru: Чтобы отсканировать карту, вам нужно обновить настройки телефона.
zh_hans: 要扫描您的银行卡，您需要更新手机设置。
zh_hant: 要掃描卡片，您必須更新您的手機設定

source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
he: סגרו
hi: बंद करें
id: Tutup
ja: 閉じる
ko: 닫기
pt_br: Fechar
pt_pt: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

source: Torch
ar: الكشاف
de: Taschenlampe
es: Linterna
fr: Flash
he: הדליקו
hi: टॉर्च
id: Lampu
ja: フラッシュライト
ko: 플래시
pt_br: Lanterna
pt_pt: Flash
ru: Фонарик
zh_hans: 手电筒
zh_hant: 手電筒

source: Enter card details manually
ar: أدخل تفاصيل البطاقة يدوياً
de: Kartendaten manuell eingeben
es: Ingresar manualmente los datos
fr: Saisissez vous-même les données de la carte
he: הזינו את פרטי הכרטיס באופן ידני
hi: कार्ड विवरण मैन्युअल रूप से दर्ज करें
id: Masukkan rincian kartu secara manual
ja: カードの詳細を手入力してください
ko: 카드 정보 직접 입력
pt_br: Insira os dados manualmente
pt_pt: Insira os dados manualmente
ru: Введите данные карты вручную
zh_hans: 手动输入银行卡信息
zh_hant: 手動輸入卡片資訊

source: We need you to confirm this card
ar: نحتاج منك إلى تأكيد هذه البطاقة
de: Sie müssen diese Karte bestätigen
es: Necesitamos que confirmes esta tarjeta
fr: Vous devez confirmer cette carte
he: אנחנו צריכים שתאשרו את הכרטיס הזה
hi: हमें आपसे इस कार्ड की पुष्टि करवानी है
id: Anda perlu mengkonfirmasi kartu ini
ja: このカードの確認を行っていただく必要があります
ko: 이 카드를 확인해 주셔야 합니다
pt_br: Precisamos que você confirme este cartão
pt_pt: Necessitamos que confirme este cartão
ru: Нам нужно, чтобы вы подтвердили эту карту
zh_hans: 请您确认这张银行卡
zh_hant: 我們需要您確認這張卡片

source: Get your card ready so you can scan it with your phone. This helps us keep your account secure.
ar: جهّز بطاقتك لتتمكن من مسحها ضوئياً بواسطة هاتفك. سيعمل ذلك على الحفاظ على أمان حسابك.
de: Halten Sie Ihre Karte zum Einscannen mit dem Telefon bereit. Dies hilft uns, Ihr Konto zu schützen.
es: Prepara tu tarjeta para poder escanearla con tu teléfono. Esto nos ayuda a mantener segura tu cuenta.
fr: Préparez votre carte pour la scanner avec votre téléphone. Cela nous permet de sécuriser votre compte.
he: הכינו את הכרטיס כך שתוכלו לסרוק אותו עם הטלפון. זה עוזר לנו לשמור על חשבנוכם מאובטח.
hi: अपना कार्ड तैयार करें ताकि आप इसे अपने फ़ोन से स्कैन कर सकें। यह हमें आपके अकाउंट को सुरक्षित रखने में मदद करता है।
id: Siapkan kartu agar Anda dapat memindainya dengan ponsel. Ini membantu kami mengamankan akun Anda.
ja: カードをスマホでスキャンできるように準備してください。アカ ウントの安全性を確保するのに役立ちます。
ko: 카드를 준비해서 스마트폰으로 스캔하세요. 귀하의 계정을 안전하게 유지하는 데 도움이 됩니다.
pt_br: Tenha seu cartão em mãos para poder escaneá-lo com seu celular. Isso nos ajuda a manter sua conta protegida.
pt_pt: Prepare o seu cartão para o poder scanear com o seu telefone. Este passo ajuda-nos a manter a sua conta segura.
ru: Подготовьте карту, чтобы можно было отсканировать ее с помощью телефона. Это поможет нам защитить ваш аккаунт.
zh_hans: 准备好银行卡，以便您能用手机扫描它。这有助于我们保证您的账户安全。
zh_hant: 準備好您的卡片，以便用手機進行掃描。這有助於我們保護您的帳戶安全。

source: Scan my card
ar: امسح بطاقتي ضوئياً
de: Meine Karte einscannen
es: Escanear mi tarjeta
fr: Scanner ma carte
he: סרקו את הכרטיס שלי
hi: मेरा कार्ड स्कैन करें
id: Pindai kartu saya
ja: 自分のカードをスキャン
ko: 내 카드 스캔
pt_br: Escanear meu cartão
pt_pt: Scanear o meu cartão
ru: Отсканировать мою карту
zh_hans: 扫描我的银行卡
zh_hant: 掃描我的卡片

source: I don't have this card
ar: ليس لدي هذه البطاقة
de: Ich habe diese Karte nicht
es: No tengo esta tarjeta
fr: Je n’ai pas cette carte
he: הכרטיס הזה אינו ברשותי
hi: मेरे पास यह कार्ड नहीं है
id: Saya tidak punya kartu ini
ja: このカードを持っていない
ko: 제게 이 카드가 없습니다
pt_br: Eu não tenho este cartão
pt_pt: Não tenho este cartão
ru: У меня нет этой карты
zh_hans: 我没有这张银行卡
zh_hant: 我沒有這張卡片

source: Card doesn't match
ar: البطاقة غير متطابقة
de: Karte stimmt nicht überein
es: La tarjeta no concuerda
fr: La carte ne correspond pas
he: הכרטיס אינו תואם
hi: कार्ड मेल नहीं खाता
id: Kartu tidak cocok
ja: カードが一致しません
ko: 카드가 일치하지 않습니다
pt_br: O cartão não corresponde
pt_pt: O cartão não coincide
ru: Карта не совпадает
zh_hans: 银行卡不匹配
zh_hant: 卡片不相符

source: Try to pay another way
ar: حاول الدفع بطريقة أخرى
de: Versuchen Sie, auf andere Weise zu zahlen
es: Intenta pagar de otra forma
fr: Essayez un autre moyen de paiement
he: נסו לשלם בדרך אחרת
hi: अन्य तरीके से भुगतान करने का प्रयास करें
id: Cobalah untuk membayar dengan cara lain
ja: 別の方法でのお支払いをお試しください
ko: 다른 결제 방법 시도
pt_br: Tente pagar de outra forma
pt_pt: Tente pagar de outra forma
ru: Попробовать заплатить другим способом
zh_hans: 尝试其他方式支付
zh_hant: 嘗試用其他方式支付
