<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Assets.car</key>
		<data>
		FZS+ZWrM4JdUMSZvWG+7dxI3SQg=
		</data>
		<key>CardScan.storyboardc/Info.plist</key>
		<data>
		ITnP0DGQ6iQHTbdaNt78cxkoQMo=
		</data>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib</key>
		<data>
		o1VA0S28QnJTiVp3SpBaa9tovTg=
		</data>
		<key>CardScan.storyboardc/scanCardViewController.nib</key>
		<data>
		quO2aSkONyIwtIHqq0kf49YN5hI=
		</data>
		<key>Headers/CardScan-Swift.h</key>
		<data>
		/PQjza+GwsVl2K+sBrSIKE2GRW0=
		</data>
		<key>Headers/CardScan.h</key>
		<data>
		nYNi49fi8rkcegU8R8d2s063aQI=
		</data>
		<key>Info.plist</key>
		<data>
		ZkeMoNSxmWCLKgrjJK6us0zPsnk=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<data>
		75Bd96RMTdKYrurtFnu5uwg46Mw=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<data>
		Ki1GB/WjUwVsVut/HLu01iySWTo=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<data>
		fzO4V24z3Vn5IrFJHt7u9OdnEgo=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftdoc</key>
		<data>
		75Bd96RMTdKYrurtFnu5uwg46Mw=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftinterface</key>
		<data>
		Ki1GB/WjUwVsVut/HLu01iySWTo=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftmodule</key>
		<data>
		fzO4V24z3Vn5IrFJHt7u9OdnEgo=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		reFlzINSt3TH36OtCPfdH3oKv/s=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		vi4lBKk03dNlY58zkGsdzq84bE4=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		Sc0o7HnKqOOVBdjiSm9lXE0mYOc=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<data>
		reFlzINSt3TH36OtCPfdH3oKv/s=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<data>
		vi4lBKk03dNlY58zkGsdzq84bE4=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<data>
		Sc0o7HnKqOOVBdjiSm9lXE0mYOc=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		0Ci9aY73QbQx2gE4jeC2im93Z4Y=
		</data>
		<key>SSDOcr.mlmodelc/analytics/coremldata.bin</key>
		<data>
		UiqLFTJsqxBORHoSroDEfIZPDx8=
		</data>
		<key>SSDOcr.mlmodelc/coremldata.bin</key>
		<data>
		zfDnP344UgORYJpxG1y11LTydN0=
		</data>
		<key>SSDOcr.mlmodelc/metadata.json</key>
		<data>
		8i7/JUTm8cdk0GIi3aoshxX0SqI=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.net</key>
		<data>
		N+nYGES7fZ/QQ8Ot9dQEtLbk1nU=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.shape</key>
		<data>
		W3/9JheWzzwl118npp97v5UaPc8=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.weights</key>
		<data>
		PObM/mvTxhseG0ZBN7HvnJW2afc=
		</data>
		<key>SSDOcr.mlmodelc/model/coremldata.bin</key>
		<data>
		wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
		</data>
		<key>SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>ar.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			SdUvoLBWVqoW98wfTj/TgiRhdao=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>card_types.txt</key>
		<data>
		RTgAYbU/tSutxSHDJ9ypn0hBrAg=
		</data>
		<key>de.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			Czl/0y23daTKisLPWNzwZ8Lncoc=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			aKlcL3AaznHxvbsvUTiL+W7My0g=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>es.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			Yjxod+tUcjIBu4WbqzEp5AQhUUQ=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>fr.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			lo/YHFis+jOt6Cfiny7PrprIvoE=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>he.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			9XWhqQFH6jrGdfJJtSfyG+vL0pA=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>hi.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			a8/iicioc3T9A7xijL4VB4t8j38=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>id.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			Tw73EG7hy+30IFw0TrO7U6rw6Do=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>ja.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			4XCibSXRgHHbDdkdmYrWVxAreyg=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>ko.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			X+ASfDuxzUQ/OmVnn9ImdBA8kW0=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>pt-BR.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			7GBAVar9Py5QUrAzA/VEAJp/fcQ=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>pt-PT.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			OwMkFV+1vikBmvyifWy8FVihIFc=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>ru.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			Uh/pJhbXZ5yaxw69LOEG7ugyu9k=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>zh-Hans.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			ImXCBGFIQBXvH8f8yKJyt3N6gWw=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>zh-Hant.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			96A718R8+vaKwkwV2IXd8+058ow=
			</data>
			<key>optional</key>
			<true/>
		</dict>
	</dict>
	<key>files2</key>
	<dict>
		<key>Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			3HpbN9WhemBoyh5+jenqGeETlINTVMnmWQAVdhG4PNQ=
			</data>
		</dict>
		<key>CardScan.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			Mi4XiqiCD95tFZJtKjB+STfGFfGE8PzaGNtjbYbE0qo=
			</data>
		</dict>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			jzFw5t8+oU+c0u7gq8+vlGOmcrVatPWbpU3E0ITC3iQ=
			</data>
		</dict>
		<key>CardScan.storyboardc/scanCardViewController.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			VZmmN9bYuwZU73JyoBbrYLjfR6x1rT2+/KzXkSSKbB0=
			</data>
		</dict>
		<key>Headers/CardScan-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			Dac8SGnOynN4g0U0L1VQJAUvtrRZ3+oDnkpoJZd0kjM=
			</data>
		</dict>
		<key>Headers/CardScan.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ipXGxAtxJ8sUGW7clEAvqqlFwJugKHgijJl9YGCvXME=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			yslca/odX5BcL31Tl2omscIfTD4RwJidv1gTXBG44fw=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			lDxtVGhpK34jKGsxggj9d+ueuQMMgB/UmcUK+N2VkUY=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			CS2vndNm8HVc5/oxs3RHHCE59bfEWpKwdGtJBYcj/Mk=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			yslca/odX5BcL31Tl2omscIfTD4RwJidv1gTXBG44fw=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			lDxtVGhpK34jKGsxggj9d+ueuQMMgB/UmcUK+N2VkUY=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			CS2vndNm8HVc5/oxs3RHHCE59bfEWpKwdGtJBYcj/Mk=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			+CuJduDJpm85o1NQU2Fn3N7o/vBEQeB/WLECMSB9hBk=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			xgOG/TIxoUqjF+DmzWwabl7Rn96/kw5WPWP9e7n16Ok=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			ZqRCBeydYsuH3uWq4b4ayoZGK9gt9UYiST2ot70WoAs=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			+CuJduDJpm85o1NQU2Fn3N7o/vBEQeB/WLECMSB9hBk=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			xgOG/TIxoUqjF+DmzWwabl7Rn96/kw5WPWP9e7n16Ok=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			ZqRCBeydYsuH3uWq4b4ayoZGK9gt9UYiST2ot70WoAs=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			XGqmx9U5Zp3bz/gIbYj6va3hLpRHmjc9NvO3dkxMfZ4=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			uEWWgepKCIZa2CqzXumqoztbLmlRPow8FGNIXwdF+xY=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			mgoFQxyQNHJ5v9R+M7D3NJxcTLaOIBVUk5tlBoYS+bw=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			dPzl1GwkbX0YeBlZ/+MV7jF4U32gaYNQ4QTI2r7djfk=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			7F//E23pS9+M6WX5N53EkHrVdCX22oEjnohHmc7N0VU=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			zZ5wv2sH3eRzn2pBwbDonQtWV3SkS4N/XPn0WD8F1AA=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			oT/Gghig43PrZvEbK4QLjX/4EbDWh/pmTNSBHakJ8vA=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			hbCZFIrZAF+IjdmBIFJ3wbNm1hBnaN4fctkyWK6u12w=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>ar.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			hVWc4eQInE3fssXcpDDKYgi57/aYZCth1ATDyePp9RI=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>card_types.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			XGoevBnAadOR/4UwuXXtMuZyWcS9TvBYH2TdtPeAU3g=
			</data>
		</dict>
		<key>de.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			eJks8m/7IE+kfXM/Q4BY1fm+qaVOsXiEUXEVp5cdwSg=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			AffIXPpqYr3JZsDP9nFVH8BK2bhYunkkhPZYkE0MN/8=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>es.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			nA9Wt7GmkP+kSHGrMVBVP8Lz5gCd7XkMH0Qiwukd4+8=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>fr.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			agmr6I0DX/ETr08RJn7ELBZTIqYP/1c2e0YlH+777iA=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>he.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			GXet1Iv/0idva3/ppJq51odtdBSwcc/YTAMIjVZ41BA=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>hi.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			TGORI2djuYyggrqUfDmzFj8Lw1v/G4rlBq9kEnqRy8w=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>id.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			fhrSf1FljCTYCgVm4647msMcg7Wm/971nKrcbG01naA=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>ja.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			PBe6U3lvn9yumd2zsttB0Cl58tWkhfJSZRdoxHUoc18=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>ko.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			NXLoxwDSfpJzybZD41L/KJC4QIU6SX4jqLJ8sA9JKGc=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>pt-BR.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			f/AzyctFgujm2xSvHts1nnzp6T5kMffzJwaycMfjqBE=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>pt-PT.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			XYBenp0WGTo6NAIYzEAIDtR8RN4W+lS7+LSi7uZPLsg=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>ru.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			6sDSVbk57K0eDH7IxGe2453HtyZKTQjoui8D48OELzM=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>zh-Hans.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			TYiY95cQDsZlmlpcF21H/DEuQFK9VyFTRHjlO9+T9Dc=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>zh-Hant.lproj/Localizable.strings</key>
		<dict>
			<key>hash2</key>
			<data>
			xgBSdO7uycGPttUw2cBYEKwvBHQsXeemb+lNQeaqHyU=
			</data>
			<key>optional</key>
			<true/>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
