<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Assets.car</key>
		<data>
		Y0UX1XN/PqNVlLRnEI8dGeB23fg=
		</data>
		<key>CardScan.storyboardc/Info.plist</key>
		<data>
		ITnP0DGQ6iQHTbdaNt78cxkoQMo=
		</data>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib</key>
		<data>
		cxulOTuwUIFZuSplY/f2xeLNrZE=
		</data>
		<key>CardScan.storyboardc/scanCardViewController.nib</key>
		<data>
		Qw0wRJE/pGL7fojfk+tnmE5l6AQ=
		</data>
		<key>Headers/CardScan-Swift.h</key>
		<data>
		nVLiVg5o+Hc25vDllIxc+dWjFd4=
		</data>
		<key>Headers/CardScan.h</key>
		<data>
		nYNi49fi8rkcegU8R8d2s063aQI=
		</data>
		<key>Info.plist</key>
		<data>
		CW9r6uxrF26u4hVm4/kP/p/O2LI=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<data>
		jUKUgoAbYIHYwO8++oXwzINenBw=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<data>
		BBtqLyipS+q54ptClQ52lXATZOM=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<data>
		BYwrEcYd2U7PKj5GrugdYhmVzP4=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftdoc</key>
		<data>
		jUKUgoAbYIHYwO8++oXwzINenBw=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftinterface</key>
		<data>
		BBtqLyipS+q54ptClQ52lXATZOM=
		</data>
		<key>Modules/CardScan.swiftmodule/arm64.swiftmodule</key>
		<data>
		BYwrEcYd2U7PKj5GrugdYhmVzP4=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		u2YVLPsAQKOgruxnQfjJj2MblFc=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		mxRqd4sGnifveksDU7rcEKUNtUE=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		UauEE1xDkGUybpiexcC+nM54VyI=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<data>
		u2YVLPsAQKOgruxnQfjJj2MblFc=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<data>
		mxRqd4sGnifveksDU7rcEKUNtUE=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<data>
		UauEE1xDkGUybpiexcC+nM54VyI=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		0Ci9aY73QbQx2gE4jeC2im93Z4Y=
		</data>
		<key>SSDOcr.mlmodelc/analytics/coremldata.bin</key>
		<data>
		UiqLFTJsqxBORHoSroDEfIZPDx8=
		</data>
		<key>SSDOcr.mlmodelc/coremldata.bin</key>
		<data>
		zfDnP344UgORYJpxG1y11LTydN0=
		</data>
		<key>SSDOcr.mlmodelc/metadata.json</key>
		<data>
		8i7/JUTm8cdk0GIi3aoshxX0SqI=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.net</key>
		<data>
		N+nYGES7fZ/QQ8Ot9dQEtLbk1nU=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.shape</key>
		<data>
		W3/9JheWzzwl118npp97v5UaPc8=
		</data>
		<key>SSDOcr.mlmodelc/model.espresso.weights</key>
		<data>
		PObM/mvTxhseG0ZBN7HvnJW2afc=
		</data>
		<key>SSDOcr.mlmodelc/model/coremldata.bin</key>
		<data>
		wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
		</data>
		<key>SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>card_types.txt</key>
		<data>
		RTgAYbU/tSutxSHDJ9ypn0hBrAg=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			06vIRMIRpPpOi13ljHyLFEPeXoih+P4EZbaC+IiGXEc=
			</data>
		</dict>
		<key>CardScan.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			Mi4XiqiCD95tFZJtKjB+STfGFfGE8PzaGNtjbYbE0qo=
			</data>
		</dict>
		<key>CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			coiqgf4S9VSJdGjRVAlT5Tw7u9X385xTT0hPs12zfhU=
			</data>
		</dict>
		<key>CardScan.storyboardc/scanCardViewController.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			ZBZ/TI+ITVDFmtDQm/fBNKMgufQKqN8lEThEbhiyKpI=
			</data>
		</dict>
		<key>Headers/CardScan-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			jgw4GmZ8i5/7K1HTjIOVXtMxJaMLkrqPHOMoY3jI0KE=
			</data>
		</dict>
		<key>Headers/CardScan.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ipXGxAtxJ8sUGW7clEAvqqlFwJugKHgijJl9YGCvXME=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			2PJp3ZZzTNMk49GQ+AWUclBPiTNH6BdytiLOKkMOqAI=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			kl2HCbgmHWpw8C0mVIHnJ7nc7dHKybCQLZB2DxmIM5U=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			5WytbNcBu7vgac4e6qNPIHYlSS36s3KP/NsUtvPV0Do=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			2PJp3ZZzTNMk49GQ+AWUclBPiTNH6BdytiLOKkMOqAI=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			kl2HCbgmHWpw8C0mVIHnJ7nc7dHKybCQLZB2DxmIM5U=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			5WytbNcBu7vgac4e6qNPIHYlSS36s3KP/NsUtvPV0Do=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			iSbFoCt2xJutcfyZGjFyYaUbStjnEWQyUt9yVTnXaps=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			/NO1SdCNa9PI3p9kg76aNL1JMV+6VTkJpASN2Ex0UDo=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			LOPIUk2X5nBKi8dbmnzZWqsFe+/mecCMoM0uzEwIkZo=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			iSbFoCt2xJutcfyZGjFyYaUbStjnEWQyUt9yVTnXaps=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			/NO1SdCNa9PI3p9kg76aNL1JMV+6VTkJpASN2Ex0UDo=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			LOPIUk2X5nBKi8dbmnzZWqsFe+/mecCMoM0uzEwIkZo=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			XGqmx9U5Zp3bz/gIbYj6va3hLpRHmjc9NvO3dkxMfZ4=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			uEWWgepKCIZa2CqzXumqoztbLmlRPow8FGNIXwdF+xY=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			mgoFQxyQNHJ5v9R+M7D3NJxcTLaOIBVUk5tlBoYS+bw=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			dPzl1GwkbX0YeBlZ/+MV7jF4U32gaYNQ4QTI2r7djfk=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			7F//E23pS9+M6WX5N53EkHrVdCX22oEjnohHmc7N0VU=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			zZ5wv2sH3eRzn2pBwbDonQtWV3SkS4N/XPn0WD8F1AA=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			oT/Gghig43PrZvEbK4QLjX/4EbDWh/pmTNSBHakJ8vA=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			hbCZFIrZAF+IjdmBIFJ3wbNm1hBnaN4fctkyWK6u12w=
			</data>
		</dict>
		<key>SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>card_types.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			XGoevBnAadOR/4UwuXXtMuZyWcS9TvBYH2TdtPeAU3g=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
