<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>CardScan.bundle/Assets.car</key>
		<data>
		MARb/pfW0Y9wfVx6NfKh7hov/r0=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/Info.plist</key>
		<data>
		ITnP0DGQ6iQHTbdaNt78cxkoQMo=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/objects-11.0+.nib</key>
		<data>
		p8Ax38IVnHrQfHX1koPswBxijkk=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/runtime.nib</key>
		<data>
		yXsoBoxG3mEHlLtVCGJi7GrLahA=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/objects-11.0+.nib</key>
		<data>
		AHBwvRLIvmLKmYxZflhp/5pdVvM=
		</data>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/runtime.nib</key>
		<data>
		SLJYrNXtaVWjMha0tuqn0c1jxlM=
		</data>
		<key>CardScan.bundle/Config/card_types.txt</key>
		<data>
		RTgAYbU/tSutxSHDJ9ypn0hBrAg=
		</data>
		<key>CardScan.bundle/Info.plist</key>
		<data>
		mG61xq9hDLOh4bTypXTiVsH+Mfw=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/coremldata.bin</key>
		<data>
		F6zlnUcthx6QIQ7BFq5MmmvLPuQ=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.net</key>
		<data>
		YvnwMG8958dLbTAe6NS32RI9zcE=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.shape</key>
		<data>
		iMrTHag2ugfNEacP5gC1Q+ecXk8=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.weights</key>
		<data>
		PObM/mvTxhseG0ZBN7HvnJW2afc=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model/coremldata.bin</key>
		<data>
		wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
		</data>
		<key>CardScan.bundle/SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeDirectory</key>
		<data>
		nfyCgtUZDbYJ7PiWmjhvxc0QmSg=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements</key>
		<data>
		OnX22wWFKRSOFN1+obRynMCeyXM=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements-1</key>
		<data>
		1fZrB86SH0pKwV3tuuqU9FPbGqE=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeResources</key>
		<data>
		hEizZYq/JZd+X0UDQWrNvEneEcc=
		</data>
		<key>CardScan.bundle/_CodeSignature/CodeSignature</key>
		<data>
		2jmj7l5rSw0yVb/vlWAYkK/YBwk=
		</data>
		<key>Headers/CardScan-Swift.h</key>
		<data>
		w6XpQjtEYJvhOgy/K6SRScwvlHQ=
		</data>
		<key>Headers/CardScan-umbrella.h</key>
		<data>
		EllHr45lwngPVzZcLyH1O3DsfCg=
		</data>
		<key>Info.plist</key>
		<data>
		4kMJ4f8TkVVwcZIkx77ifRE3TGQ=
		</data>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftdoc</key>
		<data>
		KIA67BUxWyezhvK9gULCoyutn6M=
		</data>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftinterface</key>
		<data>
		0EEZh595iPYOIZanCRXoyvVO1Sk=
		</data>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftmodule</key>
		<data>
		oPdU8h6rPCXo3wZwdRzgna4vLhs=
		</data>
		<key>Modules/CardScan.swiftmodule/i386.swiftdoc</key>
		<data>
		KIA67BUxWyezhvK9gULCoyutn6M=
		</data>
		<key>Modules/CardScan.swiftmodule/i386.swiftinterface</key>
		<data>
		0EEZh595iPYOIZanCRXoyvVO1Sk=
		</data>
		<key>Modules/CardScan.swiftmodule/i386.swiftmodule</key>
		<data>
		oPdU8h6rPCXo3wZwdRzgna4vLhs=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		mNm3Fnbb7dXamt3P0IAWTW6qNcc=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		kAp+6NaP1yDDL/XX6oBSAC5NYPg=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		+475tDmTj/erfnFqcKMozYkwNRo=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<data>
		mNm3Fnbb7dXamt3P0IAWTW6qNcc=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<data>
		kAp+6NaP1yDDL/XX6oBSAC5NYPg=
		</data>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<data>
		+475tDmTj/erfnFqcKMozYkwNRo=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		H2UtVu61qUO9bRvj2QjRQkOqG5w=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>CardScan.bundle/Assets.car</key>
		<dict>
			<key>hash</key>
			<data>
			MARb/pfW0Y9wfVx6NfKh7hov/r0=
			</data>
			<key>hash2</key>
			<data>
			airjGN/jIRmcDq2oKRZZ7labZj+nselr1c2OlYNRAwI=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/Info.plist</key>
		<dict>
			<key>hash</key>
			<data>
			ITnP0DGQ6iQHTbdaNt78cxkoQMo=
			</data>
			<key>hash2</key>
			<data>
			Mi4XiqiCD95tFZJtKjB+STfGFfGE8PzaGNtjbYbE0qo=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/objects-11.0+.nib</key>
		<dict>
			<key>hash</key>
			<data>
			p8Ax38IVnHrQfHX1koPswBxijkk=
			</data>
			<key>hash2</key>
			<data>
			FxeKUaZLzh+SramuEKvEN43Tn0DBLPkoFVzFPoqAlq0=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/RWC-EC-Zxy-view-dia-FZ-zQY.nib/runtime.nib</key>
		<dict>
			<key>hash</key>
			<data>
			yXsoBoxG3mEHlLtVCGJi7GrLahA=
			</data>
			<key>hash2</key>
			<data>
			wX+ZIiv+yOpEDg2atys+v/EkWqJ3ccUkB2z/+WIn/oU=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/objects-11.0+.nib</key>
		<dict>
			<key>hash</key>
			<data>
			AHBwvRLIvmLKmYxZflhp/5pdVvM=
			</data>
			<key>hash2</key>
			<data>
			d7lHHyI72FSbqxr4lc7DMNXR+Sa9D52qk8zTQKCm9xw=
			</data>
		</dict>
		<key>CardScan.bundle/CardScan.storyboardc/scanCardViewController.nib/runtime.nib</key>
		<dict>
			<key>hash</key>
			<data>
			SLJYrNXtaVWjMha0tuqn0c1jxlM=
			</data>
			<key>hash2</key>
			<data>
			rWO0w0nxDOGjTAvdO0P1m4VDodLc8vwgDbqVVGAxUTg=
			</data>
		</dict>
		<key>CardScan.bundle/Config/card_types.txt</key>
		<dict>
			<key>hash</key>
			<data>
			RTgAYbU/tSutxSHDJ9ypn0hBrAg=
			</data>
			<key>hash2</key>
			<data>
			XGoevBnAadOR/4UwuXXtMuZyWcS9TvBYH2TdtPeAU3g=
			</data>
		</dict>
		<key>CardScan.bundle/Info.plist</key>
		<dict>
			<key>hash</key>
			<data>
			mG61xq9hDLOh4bTypXTiVsH+Mfw=
			</data>
			<key>hash2</key>
			<data>
			2mHb7BEmIL80+wz5nk8Tr/NjGxGRDnAw/BeseUPSy7Q=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			F6zlnUcthx6QIQ7BFq5MmmvLPuQ=
			</data>
			<key>hash2</key>
			<data>
			n8u+JttrnCj5hcadO9ONUmCEMZbdfiWGSMLJ2HTbZ50=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			YvnwMG8958dLbTAe6NS32RI9zcE=
			</data>
			<key>hash2</key>
			<data>
			thLw37ZKPIwFLkoJxV1/mM3i9OY8n2MCKlBLnHdZ0/4=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			iMrTHag2ugfNEacP5gC1Q+ecXk8=
			</data>
			<key>hash2</key>
			<data>
			cAvUUyQq2HU51ezroyh7pgCCJFfBMxIlk+d7SVtKwh0=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			PObM/mvTxhseG0ZBN7HvnJW2afc=
			</data>
			<key>hash2</key>
			<data>
			oT/Gghig43PrZvEbK4QLjX/4EbDWh/pmTNSBHakJ8vA=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			wBHrQmNGaE7FAYdc8Q7gD5xbSrQ=
			</data>
			<key>hash2</key>
			<data>
			hbCZFIrZAF+IjdmBIFJ3wbNm1hBnaN4fctkyWK6u12w=
			</data>
		</dict>
		<key>CardScan.bundle/SSDOcr.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeDirectory</key>
		<dict>
			<key>hash</key>
			<data>
			nfyCgtUZDbYJ7PiWmjhvxc0QmSg=
			</data>
			<key>hash2</key>
			<data>
			9a2H0FlgrTFt2jmArxGLdGfpAb38XyAFYnb/PYorQ3Q=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements</key>
		<dict>
			<key>hash</key>
			<data>
			OnX22wWFKRSOFN1+obRynMCeyXM=
			</data>
			<key>hash2</key>
			<data>
			mHkgkE6rZQ51eIwFSqCwUk5qgL/HGqMt+NI3phdD+YY=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeRequirements-1</key>
		<dict>
			<key>hash</key>
			<data>
			1fZrB86SH0pKwV3tuuqU9FPbGqE=
			</data>
			<key>hash2</key>
			<data>
			LafvEmCR43/BAEKHJ8DwYXmphRzQxwEAl1yTpdHiE7k=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeResources</key>
		<dict>
			<key>hash</key>
			<data>
			hEizZYq/JZd+X0UDQWrNvEneEcc=
			</data>
			<key>hash2</key>
			<data>
			+vK+J+rSX7jxz2+xfK0UoAhGNgcRo9K7V5jkwdokkc8=
			</data>
		</dict>
		<key>CardScan.bundle/_CodeSignature/CodeSignature</key>
		<dict>
			<key>hash</key>
			<data>
			2jmj7l5rSw0yVb/vlWAYkK/YBwk=
			</data>
			<key>hash2</key>
			<data>
			47DEQpj8HBSa+/TImW+5JCeuQeRkm5NMpJWZG3hSuFU=
			</data>
		</dict>
		<key>Headers/CardScan-Swift.h</key>
		<dict>
			<key>hash</key>
			<data>
			w6XpQjtEYJvhOgy/K6SRScwvlHQ=
			</data>
			<key>hash2</key>
			<data>
			QNhgSjIxHbCFFPKgu2MIbs0HyfaKXBtaPgzDV0WEBco=
			</data>
		</dict>
		<key>Headers/CardScan-umbrella.h</key>
		<dict>
			<key>hash</key>
			<data>
			EllHr45lwngPVzZcLyH1O3DsfCg=
			</data>
			<key>hash2</key>
			<data>
			vRmWnPyHccaYzbi9scI2xwrjiPpNg06o+Hfc2Cx1tv0=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			KIA67BUxWyezhvK9gULCoyutn6M=
			</data>
			<key>hash2</key>
			<data>
			tffHP2u5GjoC7QS0bmXj7BByNoKdvqwSU41oTbChAM4=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			0EEZh595iPYOIZanCRXoyvVO1Sk=
			</data>
			<key>hash2</key>
			<data>
			HFYsE8sOj6UDgVqgzIbSU791g8yqK4R6KruegiB9RS4=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			oPdU8h6rPCXo3wZwdRzgna4vLhs=
			</data>
			<key>hash2</key>
			<data>
			BHQS8jXQY/9WnE3SyxjwFBQ1w1/31XRC1IeykJp5SAM=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			KIA67BUxWyezhvK9gULCoyutn6M=
			</data>
			<key>hash2</key>
			<data>
			tffHP2u5GjoC7QS0bmXj7BByNoKdvqwSU41oTbChAM4=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			0EEZh595iPYOIZanCRXoyvVO1Sk=
			</data>
			<key>hash2</key>
			<data>
			HFYsE8sOj6UDgVqgzIbSU791g8yqK4R6KruegiB9RS4=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/i386.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			oPdU8h6rPCXo3wZwdRzgna4vLhs=
			</data>
			<key>hash2</key>
			<data>
			BHQS8jXQY/9WnE3SyxjwFBQ1w1/31XRC1IeykJp5SAM=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			mNm3Fnbb7dXamt3P0IAWTW6qNcc=
			</data>
			<key>hash2</key>
			<data>
			g1Ue8oXBAYoRsvqEAIif5AOMbEZEDdcA5HVcUpk0K8U=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			kAp+6NaP1yDDL/XX6oBSAC5NYPg=
			</data>
			<key>hash2</key>
			<data>
			NPijq+L54TxjWzEwe5qu6Vv25Guos0p+VvENj/9MHNU=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			+475tDmTj/erfnFqcKMozYkwNRo=
			</data>
			<key>hash2</key>
			<data>
			b5hNx+ops1e/gM3/7GgAs+QF6lMZqsmX7vxed5wygUg=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash</key>
			<data>
			mNm3Fnbb7dXamt3P0IAWTW6qNcc=
			</data>
			<key>hash2</key>
			<data>
			g1Ue8oXBAYoRsvqEAIif5AOMbEZEDdcA5HVcUpk0K8U=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftinterface</key>
		<dict>
			<key>hash</key>
			<data>
			kAp+6NaP1yDDL/XX6oBSAC5NYPg=
			</data>
			<key>hash2</key>
			<data>
			NPijq+L54TxjWzEwe5qu6Vv25Guos0p+VvENj/9MHNU=
			</data>
		</dict>
		<key>Modules/CardScan.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash</key>
			<data>
			+475tDmTj/erfnFqcKMozYkwNRo=
			</data>
			<key>hash2</key>
			<data>
			b5hNx+ops1e/gM3/7GgAs+QF6lMZqsmX7vxed5wygUg=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash</key>
			<data>
			H2UtVu61qUO9bRvj2QjRQkOqG5w=
			</data>
			<key>hash2</key>
			<data>
			SMM5FzkaThOGm6C1LVs+iMmXzl7uaRbJwnDcPnq2hSg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
