{
  "transform_params" : {
    "input1" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_value" : 0,
      "top" : "conv1_pad_output",
      "pad_pad_mode" : 0,
      "pad_t" : 0,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "input1",
      "pad_l" : 0,
      "name" : "conv1_pad",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1_relu_output_relu",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "conv1_pad_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "alpha" : -1,
      "bottom" : "conv1_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv1_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv1_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv1_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv1_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv1_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv1_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv1_relu_output",
      "type" : "activation",
      "name" : "conv1_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_1_relu_output_relu",
      "K" : 12,
      "blob_biases" : 5,
      "name" : "conv_dw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 12,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "conv1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_1_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_1_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_1_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_1_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_1_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_1_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_1_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_1_relu_output",
      "type" : "activation",
      "name" : "conv_dw_1_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_1_relu_output_relu",
      "K" : 12,
      "blob_biases" : 9,
      "name" : "conv_pw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 51,
      "bottom" : "conv_dw_1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_1_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_1_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_1_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_1_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_1_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_1_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_1_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_1_relu_output",
      "type" : "activation",
      "name" : "conv_pw_1_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_7_relu_output_relu",
      "K" : 51,
      "blob_biases" : 13,
      "name" : "conv_dw_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 51,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 51,
      "bottom" : "conv_pw_1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_7_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_7_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_7_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_7_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_7_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_7_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_7_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_7_relu_output",
      "type" : "activation",
      "name" : "conv_dw_7_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_7_relu_output_relu",
      "K" : 51,
      "blob_biases" : 17,
      "name" : "conv_pw_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_dw_7_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_7_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_7_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_7_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_7_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_7_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_7_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_7_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_7_relu_output",
      "type" : "activation",
      "name" : "conv_pw_7_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_8_relu_output_relu",
      "K" : 204,
      "blob_biases" : 21,
      "name" : "conv_dw_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 204,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_pw_7_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_8_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_8_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_8_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_8_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_8_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_8_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_8_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_8_relu_output",
      "type" : "activation",
      "name" : "conv_dw_8_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_8_relu_output_relu",
      "K" : 204,
      "blob_biases" : 25,
      "name" : "conv_pw_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_dw_8_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_8_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_8_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_8_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_8_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_8_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_8_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_8_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_8_relu_output",
      "type" : "activation",
      "name" : "conv_pw_8_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_9_relu_output_relu",
      "K" : 204,
      "blob_biases" : 29,
      "name" : "conv_dw_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 204,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_pw_8_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_9_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_9_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_9_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_9_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_9_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_9_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_9_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_9_relu_output",
      "type" : "activation",
      "name" : "conv_dw_9_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_9_relu_output_relu",
      "K" : 204,
      "blob_biases" : 33,
      "name" : "conv_pw_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_dw_9_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_9_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_9_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_9_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_9_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_9_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_9_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_9_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_9_relu_output",
      "type" : "activation",
      "name" : "conv_pw_9_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_10_relu_output_relu",
      "K" : 204,
      "blob_biases" : 37,
      "name" : "conv_dw_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 204,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_pw_9_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_10_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_10_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_10_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_10_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_10_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_10_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_10_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_10_relu_output",
      "type" : "activation",
      "name" : "conv_dw_10_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_10_relu_output_relu",
      "K" : 204,
      "blob_biases" : 41,
      "name" : "conv_pw_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_dw_10_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_10_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_10_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_10_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_10_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_10_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_10_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_10_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_10_relu_output",
      "type" : "activation",
      "name" : "conv_pw_10_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_11_relu_output_relu",
      "K" : 204,
      "blob_biases" : 45,
      "name" : "conv_dw_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 204,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_pw_10_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_11_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_11_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_11_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_11_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_11_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_11_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_11_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_11_relu_output",
      "type" : "activation",
      "name" : "conv_dw_11_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_11_relu_output_relu",
      "K" : 204,
      "blob_biases" : 49,
      "name" : "conv_pw_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_dw_11_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_11_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_11_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_11_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_11_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_11_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_11_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_11_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_11_relu_output",
      "type" : "activation",
      "name" : "conv_pw_11_relu_neg2",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "top" : "conv_pad_12_output",
      "pad_pad_mode" : 0,
      "pad_t" : 0,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "conv_pw_11_relu_output",
      "pad_l" : 0,
      "name" : "conv_pad_12",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_12_relu_output_relu",
      "K" : 204,
      "blob_biases" : 53,
      "stride_x" : 2,
      "name" : "conv_dw_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 204,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 204,
      "bottom" : "conv_pad_12_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_12_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_12_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_12_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_12_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_12_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_12_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_12_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_12_relu_output",
      "type" : "activation",
      "name" : "conv_dw_12_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_12_relu_output_relu",
      "K" : 204,
      "blob_biases" : 57,
      "name" : "conv_pw_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 409,
      "bottom" : "conv_dw_12_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_12_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_12_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_12_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_12_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_12_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_12_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_12_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_12_relu_output",
      "type" : "activation",
      "name" : "conv_pw_12_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_13_relu_output_relu",
      "K" : 409,
      "blob_biases" : 61,
      "name" : "conv_dw_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 409,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 409,
      "bottom" : "conv_pw_12_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_13_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_13_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_13_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_13_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_13_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_13_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_13_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_13_relu_output",
      "type" : "activation",
      "name" : "conv_dw_13_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_13_relu_output_relu",
      "K" : 409,
      "blob_biases" : 65,
      "name" : "conv_pw_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 409,
      "bottom" : "conv_dw_13_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_13_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_13_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_13_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_13_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_13_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_13_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_13_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_13_relu_output",
      "type" : "activation",
      "name" : "conv_pw_13_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resize1_output",
      "K" : 409,
      "blob_biases" : 69,
      "name" : "resize1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_pw_13_relu_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 2,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resize2_output",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "resize2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resize1_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 2,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resize3_output",
      "K" : 64,
      "blob_biases" : 77,
      "name" : "resize3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resize2_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 2,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resize4_output",
      "K" : 64,
      "blob_biases" : 81,
      "name" : "resize4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resize3_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 6,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_preds_output",
      "K" : 64,
      "blob_biases" : 85,
      "name" : "conv_preds",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "resize4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output1",
      "type" : "softmax",
      "name" : "act_softmax",
      "bottom" : "conv_preds_output"
    }
  ]
}