{
  "transform_params" : {
    "0" : {
      "bias_a" : 0,
      "bias_g" : -0.99221789836883545,
      "bias_r" : -0.99221789836883545,
      "bias_b" : -0.99221789836883545,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0077821011655032635
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "379",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "377",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "382",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "380",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "379",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "384",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "383",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "382",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "387",
      "blob_weights" : 15,
      "K" : 8,
      "blob_biases" : 13,
      "name" : "385",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "384",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "390",
      "blob_weights" : 19,
      "K" : 48,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "388",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "387",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "392",
      "blob_weights" : 23,
      "K" : 48,
      "blob_biases" : 21,
      "name" : "391",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "390",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "395",
      "blob_weights" : 27,
      "K" : 12,
      "blob_biases" : 25,
      "name" : "393",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "392",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "398",
      "blob_weights" : 31,
      "K" : 72,
      "blob_biases" : 29,
      "name" : "396",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "395",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "400",
      "blob_weights" : 35,
      "K" : 72,
      "blob_biases" : 33,
      "name" : "399",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "398",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "392,400",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "401",
      "type" : "elementwise",
      "name" : "401",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "404",
      "blob_weights" : 39,
      "K" : 12,
      "blob_biases" : 37,
      "name" : "402",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "401",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "407",
      "blob_weights" : 43,
      "K" : 72,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "405",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "404",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "409",
      "blob_weights" : 47,
      "K" : 72,
      "blob_biases" : 45,
      "name" : "408",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "407",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "412",
      "blob_weights" : 51,
      "K" : 16,
      "blob_biases" : 49,
      "name" : "410",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "409",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "415",
      "blob_weights" : 55,
      "K" : 96,
      "blob_biases" : 53,
      "name" : "413",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "412",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "417",
      "blob_weights" : 59,
      "K" : 96,
      "blob_biases" : 57,
      "name" : "416",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "415",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "409,417",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "418",
      "type" : "elementwise",
      "name" : "418",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "421",
      "blob_weights" : 63,
      "K" : 16,
      "blob_biases" : 61,
      "name" : "419",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "418",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "424",
      "blob_weights" : 67,
      "K" : 96,
      "blob_biases" : 65,
      "name" : "422",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "421",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "426",
      "blob_weights" : 71,
      "K" : 96,
      "blob_biases" : 69,
      "name" : "425",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "424",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "418,426",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "427",
      "type" : "elementwise",
      "name" : "427",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "430",
      "blob_weights" : 75,
      "K" : 16,
      "blob_biases" : 73,
      "name" : "428",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "427",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "433",
      "blob_weights" : 79,
      "K" : 96,
      "blob_biases" : 77,
      "stride_x" : 2,
      "name" : "431",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "430",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "435",
      "blob_weights" : 83,
      "K" : 96,
      "blob_biases" : 81,
      "name" : "434",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "433",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "438",
      "blob_weights" : 87,
      "K" : 32,
      "blob_biases" : 85,
      "name" : "436",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "435",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "441",
      "blob_weights" : 91,
      "K" : 192,
      "blob_biases" : 89,
      "name" : "439",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "438",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "443",
      "blob_weights" : 95,
      "K" : 192,
      "blob_biases" : 93,
      "name" : "442",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "441",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "435,443",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "444",
      "type" : "elementwise",
      "name" : "444",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "447",
      "blob_weights" : 99,
      "K" : 32,
      "blob_biases" : 97,
      "name" : "445",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "444",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "450",
      "blob_weights" : 103,
      "K" : 192,
      "blob_biases" : 101,
      "name" : "448",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "447",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "452",
      "blob_weights" : 107,
      "K" : 192,
      "blob_biases" : 105,
      "name" : "451",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "450",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "444,452",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "453",
      "type" : "elementwise",
      "name" : "453",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "456",
      "blob_weights" : 111,
      "K" : 32,
      "blob_biases" : 109,
      "name" : "454",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "453",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "459",
      "blob_weights" : 115,
      "K" : 192,
      "blob_biases" : 113,
      "name" : "457",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "456",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "461",
      "blob_weights" : 119,
      "K" : 192,
      "blob_biases" : 117,
      "name" : "460",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "459",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "453,461",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "462",
      "type" : "elementwise",
      "name" : "462",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "465",
      "blob_weights" : 123,
      "K" : 32,
      "blob_biases" : 121,
      "name" : "463",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "462",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "468",
      "blob_weights" : 127,
      "K" : 192,
      "blob_biases" : 125,
      "name" : "466",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "465",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "470",
      "blob_weights" : 131,
      "K" : 192,
      "blob_biases" : 129,
      "name" : "469",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "468",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "473",
      "blob_weights" : 135,
      "K" : 48,
      "blob_biases" : 133,
      "name" : "471",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "470",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "476",
      "blob_weights" : 139,
      "K" : 288,
      "blob_biases" : 137,
      "name" : "474",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "473",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "478",
      "blob_weights" : 143,
      "K" : 288,
      "blob_biases" : 141,
      "name" : "477",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "476",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "470,478",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "479",
      "type" : "elementwise",
      "name" : "479",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "482",
      "blob_weights" : 147,
      "K" : 48,
      "blob_biases" : 145,
      "name" : "480",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "479",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "485",
      "blob_weights" : 151,
      "K" : 288,
      "blob_biases" : 149,
      "name" : "483",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "482",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "487",
      "blob_weights" : 155,
      "K" : 288,
      "blob_biases" : 153,
      "name" : "486",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "485",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "479,487",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "488",
      "type" : "elementwise",
      "name" : "488",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "491",
      "blob_weights" : 159,
      "K" : 48,
      "blob_biases" : 157,
      "name" : "489",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "488",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "494",
      "blob_weights" : 163,
      "K" : 288,
      "blob_biases" : 161,
      "stride_x" : 2,
      "name" : "492",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "491",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "496",
      "blob_weights" : 167,
      "K" : 288,
      "blob_biases" : 165,
      "name" : "495",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "494",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "499",
      "blob_weights" : 171,
      "K" : 288,
      "blob_biases" : 169,
      "name" : "497",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "491",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "502",
      "blob_weights" : 175,
      "K" : 288,
      "blob_biases" : 173,
      "name" : "500",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "499",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "505",
      "blob_weights" : 179,
      "K" : 288,
      "blob_biases" : 177,
      "name" : "503",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "502",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "506",
      "blob_weights" : 183,
      "K" : 288,
      "blob_biases" : 181,
      "name" : "506",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 33,
      "bottom" : "505",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "axis_k" : 1,
      "bottom" : "506",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "507",
      "type" : "transpose",
      "name" : "507"
    },
    {
      "top" : "509",
      "name" : "509",
      "dst_w" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "bottom" : "507",
      "hint_fallback_from_metal" : 1,
      "dst_seq" : -1,
      "dst_k" : 11,
      "weights" : {

      }
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "511",
      "blob_weights" : 187,
      "K" : 288,
      "blob_biases" : 185,
      "name" : "510",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "491",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "511",
      "weights" : {

      },
      "mode" : 6,
      "top" : "511_scale_0_1",
      "type" : "activation",
      "name" : "512_scale_0_1",
      "beta" : 0
    },
    {
      "bottom" : "511_scale_0_1",
      "weights" : {

      },
      "mode" : 7,
      "top" : "511_clip_0_1",
      "type" : "activation",
      "name" : "512_clip_0_1",
      "beta" : 0
    },
    {
      "alpha" : 6,
      "bottom" : "511_clip_0_1",
      "weights" : {

      },
      "mode" : 6,
      "top" : "512",
      "type" : "activation",
      "name" : "512",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "513",
      "blob_weights" : 191,
      "K" : 288,
      "blob_biases" : 189,
      "name" : "513",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "512",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "axis_k" : 1,
      "bottom" : "513",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "514",
      "type" : "transpose",
      "name" : "514"
    },
    {
      "name" : "524",
      "bottom" : "514",
      "dst_n" : 0,
      "mode" : 0,
      "dst_seq" : 1,
      "dst_k" : 1,
      "weights" : {

      },
      "top" : "524",
      "dst_h" : -1,
      "dst_w" : 4,
      "type" : "reshape"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "527",
      "blob_weights" : 195,
      "K" : 80,
      "blob_biases" : 193,
      "name" : "525",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "496",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "530",
      "blob_weights" : 199,
      "K" : 480,
      "blob_biases" : 197,
      "name" : "528",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "527",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "532",
      "blob_weights" : 203,
      "K" : 480,
      "blob_biases" : 201,
      "name" : "531",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "530",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "496,532",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "533",
      "type" : "elementwise",
      "name" : "533",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "536",
      "blob_weights" : 207,
      "K" : 80,
      "blob_biases" : 205,
      "name" : "534",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "533",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "539",
      "blob_weights" : 211,
      "K" : 480,
      "blob_biases" : 209,
      "name" : "537",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "536",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "541",
      "blob_weights" : 215,
      "K" : 480,
      "blob_biases" : 213,
      "name" : "540",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "539",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "533,541",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "542",
      "type" : "elementwise",
      "name" : "542",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "545",
      "blob_weights" : 219,
      "K" : 80,
      "blob_biases" : 217,
      "name" : "543",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "542",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "548",
      "blob_weights" : 223,
      "K" : 480,
      "blob_biases" : 221,
      "name" : "546",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "545",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "550",
      "blob_weights" : 227,
      "K" : 480,
      "blob_biases" : 225,
      "name" : "549",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "548",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "553",
      "blob_weights" : 231,
      "K" : 160,
      "blob_biases" : 229,
      "name" : "551",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1280,
      "bottom" : "550",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "556",
      "blob_weights" : 235,
      "K" : 1280,
      "blob_biases" : 233,
      "name" : "554",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1280,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 1280,
      "bottom" : "553",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "559",
      "blob_weights" : 239,
      "K" : 1280,
      "blob_biases" : 237,
      "name" : "557",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1280,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 1280,
      "bottom" : "556",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "562",
      "blob_weights" : 243,
      "K" : 1280,
      "blob_biases" : 241,
      "name" : "560",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1280,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 1280,
      "bottom" : "559",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "563",
      "blob_weights" : 247,
      "K" : 1280,
      "blob_biases" : 245,
      "name" : "563",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 33,
      "bottom" : "562",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "axis_k" : 1,
      "bottom" : "563",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "564",
      "type" : "transpose",
      "name" : "564"
    },
    {
      "name" : "566",
      "bottom" : "564",
      "dst_n" : 0,
      "mode" : 0,
      "dst_seq" : -1,
      "dst_k" : 11,
      "weights" : {

      },
      "top" : "566",
      "dst_h" : 1,
      "dst_w" : 1,
      "type" : "reshape"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "568",
      "blob_weights" : 251,
      "K" : 1280,
      "blob_biases" : 249,
      "name" : "567",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1280,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 1280,
      "bottom" : "553",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "568",
      "weights" : {

      },
      "mode" : 6,
      "top" : "568_scale_0_1",
      "type" : "activation",
      "name" : "569_scale_0_1",
      "beta" : 0
    },
    {
      "bottom" : "568_scale_0_1",
      "weights" : {

      },
      "mode" : 7,
      "top" : "568_clip_0_1",
      "type" : "activation",
      "name" : "569_clip_0_1",
      "beta" : 0
    },
    {
      "alpha" : 6,
      "bottom" : "568_clip_0_1",
      "weights" : {

      },
      "mode" : 6,
      "top" : "569",
      "type" : "activation",
      "name" : "569",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "570",
      "blob_weights" : 255,
      "K" : 1280,
      "blob_biases" : 253,
      "name" : "570",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "569",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "axis_k" : 1,
      "bottom" : "570",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "571",
      "type" : "transpose",
      "name" : "571"
    },
    {
      "name" : "581",
      "bottom" : "571",
      "dst_n" : 0,
      "mode" : 0,
      "dst_seq" : 1,
      "dst_k" : 1,
      "weights" : {

      },
      "top" : "581",
      "dst_h" : -1,
      "dst_w" : 4,
      "type" : "reshape"
    },
    {
      "bottom" : "509,566",
      "weights" : {

      },
      "simple_concat" : 1,
      "hint_fallback_from_metal" : 1,
      "top" : "582",
      "type" : "sequence_concat",
      "name" : "582"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "axis_k" : 1,
      "bottom" : "524",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "boxes_524_transpose",
      "type" : "transpose",
      "name" : "boxes_input_transpose0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "axis_k" : 1,
      "bottom" : "581",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "boxes_581_transpose",
      "type" : "transpose",
      "name" : "boxes_input_transpose1"
    },
    {
      "weights" : {

      },
      "top" : "boxes_transpose",
      "type" : "concat",
      "name" : "boxes",
      "bottom" : "boxes_524_transpose,boxes_581_transpose"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "axis_k" : 1,
      "bottom" : "boxes_transpose",
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "top" : "boxes",
      "type" : "transpose",
      "name" : "boxes_output_transpose0"
    },
    {
      "bottom" : "582",
      "alpha" : 1,
      "operation" : 27,
      "weights" : {

      },
      "hint_fallback_from_metal" : 1,
      "fused_relu" : 0,
      "top" : "584",
      "type" : "elementwise",
      "name" : "584",
      "beta" : 0
    },
    {
      "bottom" : "584",
      "axis_mode" : 4,
      "weights" : {

      },
      "mode" : 0,
      "hint_fallback_from_metal" : 1,
      "use_version" : 1,
      "top" : "585",
      "type" : "reduce",
      "name" : "585"
    },
    {
      "bottom" : "585",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 0,
      "top" : "587",
      "type" : "flatten",
      "name" : "587"
    },
    {
      "alpha" : 1,
      "bottom" : "587",
      "operation" : 10,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "587_inverse",
      "type" : "elementwise",
      "name" : "588_inverse",
      "beta" : 0
    },
    {
      "bottom" : "584,587_inverse",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "hint_fallback_from_metal" : 1,
      "fused_relu" : 0,
      "top" : "588",
      "type" : "elementwise",
      "name" : "588",
      "beta" : 0
    },
    {
      "bottom" : "588",
      "end" : 3420,
      "start" : 1,
      "weights" : {

      },
      "hint_fallback_from_metal" : 1,
      "axis" : 2,
      "top" : "589",
      "type" : "slice",
      "name" : "589"
    },
    {
      "top" : "scores",
      "name" : "scores",
      "dst_w" : 10,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "bottom" : "589",
      "hint_fallback_from_metal" : 1,
      "dst_seq" : 1,
      "dst_k" : 1,
      "weights" : {

      }
    }
  ]
}